[Killed] ArrowFunction
src/components/Scoreboard/Level.tsx:20:43
     onChange: (event: ChangeEvent<HTMLSelectElement>) => void;
 }
 
-export const Level: FC<LevelProps> = memo(({ children, value, onChange }) => (
-    <Select onChange={onChange} value={value}>
-      {children.map((item: string) => (
-        <Option key={item} value={item}>
-          {item}
-        </Option>
-      ))}
-    </Select>
-  ));
+export const Level: FC<LevelProps> = memo(() => undefined);
   // Stryker disable next-line StringLiteral
   Level.displayName = 'Level';
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 22
+ Received  +  0

@@ -42,32 +42,10 @@
