[Killed] ArrayDeclaration
src/components/Grid/Cell.tsx:27:5
 };
 
 export const isActiveCell = (cell: CellType): boolean =>
-    [CellState.hidden, CellState.flag, CellState.weakFlag].includes(cell);
+    [].includes(cell);
 
 export const Cell: FC<CellProps> = ({ children, coords, ...rest }) => {
killedBy: GameWithHooks test cases Context menu handler on a cell works fine
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/components/Grid/Cell.tsx:34:68
 
     const onClick = () => rest.onClick(coords);
 
-    const onContextMenu = (elem: React.MouseEvent<HTMLElement>) => {
-        /**
-         * Prevent context menu by default
-         */
-        elem.preventDefault();
-
-        if(isActiveCell(children)) {
-            rest.onContextMenu(coords)
-        }
-    };
+    const onContextMenu = (elem: React.MouseEvent<HTMLElement>) => {};
 
     const props = {
killedBy: GameWithHooks test cases Context menu handler on a cell works fine
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:89:9
             );
         case CellState.hidden:
             return <ClosedFrame {...rest} />;
-        case CellState.flag:
-            return (
-                <ClosedFrame {...rest}>
-                    <Flag/>
-                </ClosedFrame>
-            );
+        case CellState.flag:
         case CellState.weakFlag:
             return (
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 12`

- Snapshot  - 1
+ Received  + 1

@@ -3,9 +3,9 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:133:8
     1: '#2a48ec',
     2: '#2bb13d',
     3: '#ec6561',
-    4: '#ec6561',
+    4: "",
     5: '#a6070f',
     6: '#e400af',
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 5`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] LogicalOperator
src/components/Grid/Cell.tsx:147:32
 const RevealedFrame = styled(ClosedFrame)`
     border-color: #dddddd;
     cursor: default;
-    color: ${({ children }) => colors[children as CellType] ?? transparent};
+    color: ${({ children }) => colors[children as CellType] && transparent};
     &:hover {
         filter: brightness(1);
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>
