[Killed] ArrowFunction
src/components/Grid/Grid.tsx:21:36
     onContextMenu: (coords: Coords) => void;
 }
 
-export const Grid: FC<GridProps> = ({ children, ...rest}) => (
-    <Wrapper size={children.length}>
-        {children.map((row, y) => 
-            row.map((cell, x) => 
-                <Cell key={`${y},${x}`} coords={[y,x]} {...rest}>
-                    {cell}
-                </Cell>
-        ))}
-    </Wrapper>
-);
+export const Grid: FC<GridProps> = () => undefined;
 
 interface WrapperProps {
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render game field by default 1`

- Snapshot  - 25
+ Received  +  0

@@ -80,33 +80,8 @@

[Killed] ArrowFunction
src/components/Grid/Grid.tsx:23:23
 
 export const Grid: FC<GridProps> = ({ children, ...rest}) => (
     <Wrapper size={children.length}>
-        {children.map((row, y) => 
-            row.map((cell, x) => 
-                <Cell key={`${y},${x}`} coords={[y,x]} {...rest}>
-                    {cell}
-                </Cell>
-        ))}
+        {children.map(() => undefined)}
     </Wrapper>
 );
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render game field by default 1`

- Snapshot  - 21
+ Received  +  0

@@ -83,30 +83,9 @@

[Killed] ArrowFunction
src/components/Grid/Grid.tsx:24:21
 export const Grid: FC<GridProps> = ({ children, ...rest}) => (
     <Wrapper size={children.length}>
         {children.map((row, y) => 
-            row.map((cell, x) => 
-                <Cell key={`${y},${x}`} coords={[y,x]} {...rest}>
-                    {cell}
-                </Cell>
+            row.map(() => undefined
         ))}
     </Wrapper>
killedBy: Grid renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid renders correctly 1`

- Snapshot  - 60
+ Received  +  0

  <DocumentFragment>
