[Killed] BlockStatement
src/components/Scoreboard/Reset.tsx:13:55
     onReset: () => void;
 }
 
-export const Reset: FC<ResetProps> = ({ onReset }) => {
-    const [mouseDown, onMouseDown, onMouseUp] = useMouseDown();
-
-    return (
-        <Button 
-            onMouseDown={onMouseDown} 
-            onMouseUp={onMouseUp}
-            onMouseLeave={onMouseUp}
-            onClick={onReset}
-            >
-                {mouseDown ? '😲' : '😊'}
-        </Button>
-     );
-};
+export const Reset: FC<ResetProps> = ({ onReset }) => {};
 
 
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render game field by default 1`

- Snapshot  - 5
+ Received  + 0

@@ -64,15 +64,10 @@

[Killed] StringLiteral
src/components/Scoreboard/Reset.tsx:31:29
 
 
 
-const Button = styled.button`
-    font-size: 1.5vw;
-    cursor: pointer;
-    font-weight: 700;
-    border-width: 0.15vw;
-    border-style: solid;
-    background: #d1d1d1;
-    border-color: white #9e9e9e #9e9e9e white;
-`;
+const Button = styled.button``;
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 1
+ Received  + 1

@@ -65,11 +65,11 @@
