[Killed] ArrowFunction
src/components/Top/Legend.tsx:20:40
     secondAction: string;
 }
 
-export const Legend: FC<LegendProps> = ({
-    feature,
-    firstAction,
-    secondAction
-}) => (
-    <Parent>
-        <strong>{feature}: </strong>
-        <FlagComboParent>
-            <FirstAction>{firstAction}</FirstAction> + {' '}
-            <SecondAction>{secondAction}</SecondAction>
-        </FlagComboParent>
-    </Parent>
-)
+export const Legend: FC<LegendProps> = () => undefined
 
 const FlagComboParent = styled.code`
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 22
+ Received  +  0

@@ -8,32 +8,10 @@

[Killed] StringLiteral
src/components/Top/Legend.tsx:28:57
     <Parent>
         <strong>{feature}: </strong>
         <FlagComboParent>
-            <FirstAction>{firstAction}</FirstAction> + {' '}
+            <FirstAction>{firstAction}</FirstAction> + {""}
             <SecondAction>{secondAction}</SecondAction>
         </FlagComboParent>
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render game field by default 1`

- Snapshot  - 1
+ Received  + 1

@@ -22,11 +22,11 @@

[Killed] StringLiteral
src/components/Top/Legend.tsx:38:29
     background: #e3e3e3;
 `;
 
-const Parent = styled.legend`
-    font-size: 1em;
-    margin: 0 auto 2vw;
-    line-height: 1.25;
-`;
+const Parent = styled.legend``;
 
 const FirstAction = styled.span`
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 1
+ Received  + 1

@@ -9,11 +9,11 @@
