[Killed] ArrowFunction
src/helpers/CellsManipulator.ts:8:35
  * @param {Coords} coords
  * @returns {Record<string, [number, number]>}
  */
-export const getNeighboursItems = ([y, x]: Coords): Record<string, [number, number]> => ({
-    top: [y - 1, x],
-    topRight: [y - 1, x + 1],
-    right: [y, x + 1],
-    rightBottom: [y + 1, x + 1],
-    bottom: [y + 1, x],
-    bottomLeft: [y + 1, x - 1],
-    left: [y, x - 1],
-    leftTop: [y - 1, x - 1]
-});
+export const getNeighboursItems = () => undefined;
 
 /**
killedBy: GameWithHooks test cases Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 24
Received length: 1
Received array:  [0]

[Killed] ObjectLiteral
src/helpers/CellsManipulator.ts:8:90
  * @param {Coords} coords
  * @returns {Record<string, [number, number]>}
  */
-export const getNeighboursItems = ([y, x]: Coords): Record<string, [number, number]> => ({
-    top: [y - 1, x],
-    topRight: [y - 1, x + 1],
-    right: [y, x + 1],
-    rightBottom: [y + 1, x + 1],
-    bottom: [y + 1, x],
-    bottomLeft: [y + 1, x - 1],
-    left: [y, x - 1],
-    leftTop: [y - 1, x - 1]
-});
+export const getNeighboursItems = ([y, x]: Coords): Record<string, [number, number]> => ({});
 
 /**
killedBy: GameWithHooks test cases Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 24
Received length: 1
Received array:  [0]

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:9:11
  * @returns {Record<string, [number, number]>}
  */
 export const getNeighboursItems = ([y, x]: Coords): Record<string, [number, number]> => ({
-    top: [y - 1, x],
+    top: [y + 1, x],
     topRight: [y - 1, x + 1],
     right: [y, x + 1],
killedBy: GameWithHooks test cases Open cell test cases Check open cell when the level is changed
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [1]

[Killed] ArrayDeclaration
src/helpers/CellsManipulator.ts:9:10
  * @returns {Record<string, [number, number]>}
  */
 export const getNeighboursItems = ([y, x]: Coords): Record<string, [number, number]> => ({
-    top: [y - 1, x],
+    top: [],
     topRight: [y - 1, x + 1],
     right: [y, x + 1],
killedBy: GameWithHooks test cases Open cell test cases Check open cell when the level is changed
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [1]

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:16:22
     bottom: [y + 1, x],
     bottomLeft: [y + 1, x - 1],
     left: [y, x - 1],
-    leftTop: [y - 1, x - 1]
+    leftTop: [y - 1, x + 1]
 });
 
killedBy: Check neighbours selectors With [0,0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -11,11 +11,11 @@
      0,
      -1,

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:16:15
     bottom: [y + 1, x],
     bottomLeft: [y + 1, x - 1],
     left: [y, x - 1],
-    leftTop: [y - 1, x - 1]
+    leftTop: [y + 1, x - 1]
 });
 
killedBy: Check neighbours selectors With [0,0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -10,11 +10,11 @@
    "left": Array [
      0,

[Killed] ConditionalExpression
src/helpers/CellsManipulator.ts:25:25
  * @returns {boolean}
  */
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean => 
-    y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+    y >= 0 && x >= 0 && true && length - x > 0;
 
 /**
killedBy: Open cell action Simple case with number Open empty cell, stimple 3x3 case
statusReason: TypeError: Cannot read properties of undefined (reading '2')

[Killed] BlockStatement
src/helpers/CellsManipulator.ts:33:77
  * @param {Field} field 
  * @returns {Cell}
  */
-export const incrementNeighbours = (coords: Coords, field: Field): Field => {
-    const items = getNeighboursItems(coords);
-
-    for(const item of Object.values(items)){
-        if(checkItemInField(item, field)){
-            const [y, x] = item;
-            const cell = field[y][x];
-
-            if(cell < 8){
-                field[y][x] = (cell + 1) as Cell;
-            }
-        }
-    }
-    return field;
-};
+export const incrementNeighbours = (coords: Coords, field: Field): Field => {};
killedBy: Check Increment Neighbours Simple cases Field with only one item
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[9]]
Received: undefined

[Killed] BlockStatement
src/helpers/CellsManipulator.ts:37:42
     const items = getNeighboursItems(coords);
 
     for(const item of Object.values(items)){
-        if(checkItemInField(item, field)){
-            const [y, x] = item;
-            const cell = field[y][x];
-
-            if(cell < 8){
-                field[y][x] = (cell + 1) as Cell;
-            }
-        }
+        if(checkItemInField(item, field)){}
     }
     return field;
killedBy: Field Generator Simple cases 2x2 field with 50% probability
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] EqualityOperator
src/helpers/CellsManipulator.ts:41:16
             const [y, x] = item;
             const cell = field[y][x];
 
-            if(cell < 8){
+            if(cell >= 8){
                 field[y][x] = (cell + 1) as Cell;
             }
killedBy: Check Increment Neighbours Simple cases Field 2x2 with one bomb
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] EqualityOperator
src/helpers/CellsManipulator.ts:41:16
             const [y, x] = item;
             const cell = field[y][x];
 
-            if(cell < 8){
+            if(cell <= 8){
                 field[y][x] = (cell + 1) as Cell;
             }
killedBy: Check Increment Neighbours 3x3 cases Field 3x3 as synthetic case with neighbour cells have reached max possible bombs
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -3,15 +3,15 @@
      1,
      2,
