[Killed] BooleanLiteral
src/helpers/detectSolvedPuzzle.ts:18:36
     let bombsCounter = 0;
     let flagCounter = 0;
     let detectedBombsCounter = 0;
-    let doesFieldHaveHiddenCells = false;
+    let doesFieldHaveHiddenCells = true;
 
     for (const y of gameField.keys()) {
killedBy: Open cell action Detect win state 5x5 solved case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/helpers/detectSolvedPuzzle.ts:20:39
     let detectedBombsCounter = 0;
     let doesFieldHaveHiddenCells = false;
 
-    for (const y of gameField.keys()) {
-        for(const x of gameField[y].keys()) {
-            const gameCell = gameField[y][x];
-            const playerCell = playerField[y][x];
-            const isPlayerCellFlag = [flag, weakFlag].includes(playerCell)
-
-            if(playerCell === hidden) {
-                doesFieldHaveHiddenCells = true;
-            }
-            if(isPlayerCellFlag) {
-                flagCounter++
-            }
-            
-            if(gameCell === bomb) {
-                bombsCounter++
-
-                if(isPlayerCellFlag) {
-                    detectedBombsCounter++;
-                }
-            }
-        }
-    }
+    for (const y of gameField.keys()) {}
 
     const isPuzzleSolved = 
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 1
+ Received  + 6

@@ -72,12 +72,17 @@

[Killed] BlockStatement
src/helpers/detectSolvedPuzzle.ts:21:45
     let doesFieldHaveHiddenCells = false;
 
     for (const y of gameField.keys()) {
-        for(const x of gameField[y].keys()) {
-            const gameCell = gameField[y][x];
-            const playerCell = playerField[y][x];
-            const isPlayerCellFlag = [flag, weakFlag].includes(playerCell)
-
-            if(playerCell === hidden) {
-                doesFieldHaveHiddenCells = true;
-            }
-            if(isPlayerCellFlag) {
-                flagCounter++
-            }
-            
-            if(gameCell === bomb) {
-                bombsCounter++
-
-                if(isPlayerCellFlag) {
-                    detectedBombsCounter++;
-                }
-            }
-        }
+        for(const x of gameField[y].keys()) {}
     }
 
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 1
+ Received  + 6

@@ -72,12 +72,17 @@

[Killed] ArrayDeclaration
src/helpers/detectSolvedPuzzle.ts:24:38
         for(const x of gameField[y].keys()) {
             const gameCell = gameField[y][x];
             const playerCell = playerField[y][x];
-            const isPlayerCellFlag = [flag, weakFlag].includes(playerCell)
+            const isPlayerCellFlag = [].includes(playerCell)
 
             if(playerCell === hidden) {
killedBy: Open cell action Detect win state 5x5 solved case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/helpers/detectSolvedPuzzle.ts:26:16
             const playerCell = playerField[y][x];
             const isPlayerCellFlag = [flag, weakFlag].includes(playerCell)
 
-            if(playerCell === hidden) {
+            if(true) {
                 doesFieldHaveHiddenCells = true;
             }
killedBy: Open cell action Detect win state 5x5 solved case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/helpers/detectSolvedPuzzle.ts:27:44
             const isPlayerCellFlag = [flag, weakFlag].includes(playerCell)
 
             if(playerCell === hidden) {
-                doesFieldHaveHiddenCells = true;
+                doesFieldHaveHiddenCells = false;
             }
             if(isPlayerCellFlag) {
killedBy: Detect solved puzzle function test cases Wrong 3x3 hidden cell case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/helpers/detectSolvedPuzzle.ts:29:16
             if(playerCell === hidden) {
                 doesFieldHaveHiddenCells = true;
             }
-            if(isPlayerCellFlag) {
+            if(true) {
                 flagCounter++
             }
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player win the game when opening last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/helpers/detectSolvedPuzzle.ts:29:34
             if(playerCell === hidden) {
                 doesFieldHaveHiddenCells = true;
             }
-            if(isPlayerCellFlag) {
-                flagCounter++
-            }
+            if(isPlayerCellFlag) {}
             
             if(gameCell === bomb) {
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 1
+ Received  + 1

@@ -72,11 +72,11 @@

[Killed] UpdateOperator
src/helpers/detectSolvedPuzzle.ts:30:17
                 doesFieldHaveHiddenCells = true;
             }
             if(isPlayerCellFlag) {
-                flagCounter++
+                flagCounter--
             }
             
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 1
+ Received  + 1

@@ -72,11 +72,11 @@

[Killed] UpdateOperator
src/helpers/detectSolvedPuzzle.ts:34:17
             }
             
             if(gameCell === bomb) {
-                bombsCounter++
+                bombsCounter--
 
                 if(isPlayerCellFlag) {
killedBy: Open cell action Detect win state 5x5 solved case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/helpers/detectSolvedPuzzle.ts:36:38
             if(gameCell === bomb) {
                 bombsCounter++
 
-                if(isPlayerCellFlag) {
-                    detectedBombsCounter++;
-                }
+                if(isPlayerCellFlag) {}
             }
         }
killedBy: Detect solved puzzle function test cases Simplest 3x3 case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/helpers/detectSolvedPuzzle.ts:44:9
     }
 
     const isPuzzleSolved = 
-        bombsCounter === detectedBombsCounter &&
-        flagCounter === bombsCounter &&
+        bombsCounter === detectedBombsCounter || flagCounter === bombsCounter &&
         !doesFieldHaveHiddenCells;
     
killedBy: Detect solved puzzle function test cases Wrong flag on 3x3 case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/helpers/detectSolvedPuzzle.ts:44:9
     }
 
     const isPuzzleSolved = 
-        bombsCounter === detectedBombsCounter &&
-        flagCounter === bombsCounter &&
-        !doesFieldHaveHiddenCells;
+        false;
     
 
killedBy: Open cell action Detect win state 5x5 solved case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/helpers/detectSolvedPuzzle.ts:46:9
     const isPuzzleSolved = 
         bombsCounter === detectedBombsCounter &&
         flagCounter === bombsCounter &&
-        !doesFieldHaveHiddenCells;
+        doesFieldHaveHiddenCells;
     
 
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player win the game when flagging last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrayDeclaration
src/helpers/detectSolvedPuzzle.ts:49:12
         !doesFieldHaveHiddenCells;
     
 
-    return [isPuzzleSolved, flagCounter]
+    return []
 }
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 1
+ Received  + 1

@@ -72,11 +72,11 @@
