[Killed] ArrowFunction
src/helpers/Field.ts:15:46
     weakFlag: 12
 }
 
-export const generateFieldWithDefaultState = (
-    size: number, 
-    state: Cell = CellState.empty
-): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
+export const generateFieldWithDefaultState = () => undefined;
 
 export const fieldGenerator = (size: number, probability: number): Field => {
killedBy: Field Generator Empty field generator tests 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[0, 0], [0, 0]]
Received: undefined

[Killed] BlockStatement
src/helpers/Field.ts:20:77
     state: Cell = CellState.empty
 ): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
 
-export const fieldGenerator = (size: number, probability: number): Field => {
-    if(probability < 0 || probability > 1) {
-        throw new Error('Probability should be between 0 and 1');
-    }
-
-    let unprocessedCells = size * size;
-    let restCellsWithBombs = unprocessedCells * probability;
-
-    const result: Field = generateFieldWithDefaultState(size);
-
-    for(let y = 0; y < size; y++){
-        for(let x = 0; x < size; x++){
-            if(restCellsWithBombs / unprocessedCells > Math.random()){
-                result[y][x] = CellState.bomb;
-                incrementNeighbours([y, x], result);
-                restCellsWithBombs--;
-            }
-            unprocessedCells--;
-        }
-    }
-
-    return result;
-};
+export const fieldGenerator = (size: number, probability: number): Field => {};
killedBy: Render game field by default
statusReason: TypeError: Cannot read properties of undefined (reading 'keys')

[Killed] BlockStatement
src/helpers/Field.ts:30:34
 
     const result: Field = generateFieldWithDefaultState(size);
 
-    for(let y = 0; y < size; y++){
-        for(let x = 0; x < size; x++){
-            if(restCellsWithBombs / unprocessedCells > Math.random()){
-                result[y][x] = CellState.bomb;
-                incrementNeighbours([y, x], result);
-                restCellsWithBombs--;
-            }
-            unprocessedCells--;
-        }
-    }
+    for(let y = 0; y < size; y++){}
 
     return result;
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] BlockStatement
src/helpers/Field.ts:32:70
 
     for(let y = 0; y < size; y++){
         for(let x = 0; x < size; x++){
-            if(restCellsWithBombs / unprocessedCells > Math.random()){
-                result[y][x] = CellState.bomb;
-                incrementNeighbours([y, x], result);
-                restCellsWithBombs--;
-            }
+            if(restCellsWithBombs / unprocessedCells > Math.random()){}
             unprocessedCells--;
         }
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,
