[Killed] EqualityOperator
src/helpers/openCell.ts:29:8
         throw new Error('Game Over');
     };
 
-    if(playerCell === flag) {
+    if(playerCell !== flag) {
         return [playerField, false]
     }
killedBy: Open cell action Simple cases with loose Open cell with a flag shouldnt open
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -4,11 +4,11 @@
      10,
      10,

[Killed] ConditionalExpression
src/helpers/openCell.ts:29:8
         throw new Error('Game Over');
     };
 
-    if(playerCell === flag) {
+    if(false) {
         return [playerField, false]
     }
killedBy: Open cell action Simple cases with loose Open cell with a flag shouldnt open
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -4,11 +4,11 @@
      10,
      10,

[Killed] BooleanLiteral
src/helpers/openCell.ts:30:30
     };
 
     if(playerCell === flag) {
-        return [playerField, false]
+        return [playerField, true]
     }
 
killedBy: Open cell action Simple cases with loose Open cell with a flag shouldnt open
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/helpers/openCell.ts:35:70
 
     playerField[y][x] = gameCell;
 
-    if(gameCell === empty && [hidden, weakFlag].includes(playerCell)){
-        const items = getNeighboursItems(coords);
-
-        for( const [y,x] of Object.values(items)){
-            if(checkItemInField([y,x], gameField)){
-                [playerField] = openCell([y,x], playerField, gameField);
-
-            }
-        }
-    };
+    if(gameCell === empty && [hidden, weakFlag].includes(playerCell)){};
 
     const [isSolved] = detectSolvedPuzzle(playerField, gameField)
killedBy: GameWithHooks test cases Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 24
Received length: 1
Received array:  [0]

[Killed] ConditionalExpression
src/helpers/openCell.ts:35:8
 
     playerField[y][x] = gameCell;
 
-    if(gameCell === empty && [hidden, weakFlag].includes(playerCell)){
+    if(true && [hidden, weakFlag].includes(playerCell)){
         const items = getNeighboursItems(coords);
 
killedBy: Open cell action Simple cases with loose Open cell with a weak flag should open
statusReason: Error: Game Over

[Killed] BlockStatement
src/helpers/openCell.ts:38:50
     if(gameCell === empty && [hidden, weakFlag].includes(playerCell)){
         const items = getNeighboursItems(coords);
 
-        for( const [y,x] of Object.values(items)){
-            if(checkItemInField([y,x], gameField)){
-                [playerField] = openCell([y,x], playerField, gameField);
-
-            }
-        }
+        for( const [y,x] of Object.values(items)){}
     };
 
killedBy: GameWithHooks test cases Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 24
Received length: 1
Received array:  [0]

[Killed] BlockStatement
src/helpers/openCell.ts:39:51
         const items = getNeighboursItems(coords);
 
         for( const [y,x] of Object.values(items)){
-            if(checkItemInField([y,x], gameField)){
-                [playerField] = openCell([y,x], playerField, gameField);
-
-            }
+            if(checkItemInField([y,x], gameField)){}
         }
     };
killedBy: Open cell action Simple case with number Open empty cell, stimple 3x3 case
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
    Array [
      10,

[Killed] ArrayDeclaration
src/helpers/openCell.ts:48:12
 
     const [isSolved] = detectSolvedPuzzle(playerField, gameField)
 
-    return [playerField, isSolved];
+    return [];
 };
killedBy: Open cell action Simple cases with loose Open cell with a weak flag should open
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[10, 10, 10], [10, 1, 10], [10, 10, 10]]
Received: undefined
