[Killed] ArrowFunction
src/modules/GameWithHooks/GameWithHooks.tsx:39:36
                     bombs={String(bombs - flagCounter)}
                     levels={GameLevels}
                     defaultLevel={level}
-                    onChangeLevel={({
-                        target: {value: level},
-                    }:React.ChangeEvent<HTMLSelectElement>) => 
-                        onChangeLevel(level as LevelNames)
+                    onChangeLevel={() => undefined
                     }
                     onReset={onReset}
killedBy: GameWithHooks test cases Change level works fine
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/modules/GameWithHooks/GameWithHooks.tsx:46:18
                     }
                     onReset={onReset}
                 />
-                {isGameOver && <GameOver onClick={onReset} isWin={isWin} />}
+                {true}
                 <Grid onClick={onClick} onContextMenu={onContextMenu}>
                     {playerField}
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render game field by default 1`

- Snapshot  - 5
+ Received  + 0

@@ -76,15 +76,10 @@
