[Killed] BlockStatement
src/hooks/useMouseDown.ts:10:6
     boolean, 
     SetMouseDownStatus,
     SetMouseUpStatus
-] => {
-    const [mouseDown, setMouseDown] = useState(false);
-    
-    const onMouseDown = () => setMouseDown(true);
-    const onMouseUp = () => setMouseDown(false);
-
-    return [mouseDown, onMouseDown, onMouseUp];
-};
+] => {};
killedBy: Grid renders correctly
statusReason: TypeError: Invalid attempt to destructure non-iterable instance.
In order to be iterable, non-array objects must have a [Symbol.iterator]() method.
