[Killed] BlockStatement
src/modules/GameWithHooks/setFlag.ts:17:32
     gameField: Field,
     prevFlagCounter: number,
     bombs: number
-): [Field, boolean, number] => {
-    console.log(gameField);
-    const [y, x] = coords;
-    const cell = playerField[y][x]
-
-    const { flag, weakFlag, hidden } = CellState;
-
-    switch (cell) {
-        case flag:
-            playerField[y][x] = weakFlag;
-            break;
-        case weakFlag:
-            playerField[y][x] = hidden;
-            break;
-        case hidden:
-            if(prevFlagCounter < bombs){
-                playerField[y][x] = flag;
-            }
-            break;
-    }
-    const [isSolved, flagCounter] = detectSolvedPuzzle(playerField, gameField);
-
-    return [playerField, isSolved, flagCounter];
-}
+): [Field, boolean, number] => {}
killedBy: GameWithHooks test cases Open cell test cases Context menu handler
statusReason: TypeError: Invalid attempt to destructure non-iterable instance.
In order to be iterable, non-array objects must have a [Symbol.iterator]() method.

[Killed] BlockStatement
src/modules/GameWithHooks/setFlag.ts:32:40
             playerField[y][x] = hidden;
             break;
         case hidden:
-            if(prevFlagCounter < bombs){
-                playerField[y][x] = flag;
-            }
+            if(prevFlagCounter < bombs){}
             break;
     }
killedBy: GameWithHooks test cases Open cell test cases Context menu handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []
