[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:33:37
     const [time, setTime] = useState(0);
     const [flagCounter, setFlagCounter] = useState(0);
 
-    const setGameOver = (isSolved = false) => {
+    const setGameOver = (isSolved = true) => {
         setIsGameOver(true);
         setIsWin(isSolved);
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player lose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:33:47
     const [time, setTime] = useState(0);
     const [flagCounter, setFlagCounter] = useState(0);
 
-    const setGameOver = (isSolved = false) => {
-        setIsGameOver(true);
-        setIsWin(isSolved);
-    };
+    const setGameOver = (isSolved = false) => {};
 
     const [size, bombs] = GameSettings[level];
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player lose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:34:23
     const [flagCounter, setFlagCounter] = useState(0);
 
     const setGameOver = (isSolved = false) => {
-        setIsGameOver(true);
+        setIsGameOver(false);
         setIsWin(isSolved);
     };
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player lose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:48:21
         fieldGenerator(size, bombs / (size*size))
     )
 
-    useEffect(() => {
-        let interval: NodeJS.Timeout;
-
-        if(isGameStarted) {
-            interval = setTimeout(() => {
-                setTime(time+1);
-            }, 1000);
-
-            if(isGameOver) {
-                clearInterval(interval)
-            }
-        }
-
-        return () => {
-            clearInterval(interval);
-        };
-    }, [isGameOver, isGameStarted, time]);
+    useEffect(() => {}, [isGameOver, isGameStarted, time]);
 
     const onClick = (coords: Coords)=> {
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player lose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:51:27
     useEffect(() => {
         let interval: NodeJS.Timeout;
 
-        if(isGameStarted) {
-            interval = setTimeout(() => {
-                setTime(time+1);
-            }, 1000);
-
-            if(isGameOver) {
-                clearInterval(interval)
-            }
-        }
+        if(isGameStarted) {}
 
         return () => {
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player lose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:52:41
         let interval: NodeJS.Timeout;
 
         if(isGameStarted) {
-            interval = setTimeout(() => {
-                setTime(time+1);
-            }, 1000);
+            interval = setTimeout(() => {}, 1000);
 
             if(isGameOver) {
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player lose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ArithmeticOperator
src/modules/GameWithHooks/useGame.ts:53:25
 
         if(isGameStarted) {
             interval = setTimeout(() => {
-                setTime(time+1);
+                setTime(time - 1);
             }, 1000);
 
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player lose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -5

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:56:28
                 setTime(time+1);
             }, 1000);
 
-            if(isGameOver) {
-                clearInterval(interval)
-            }
+            if(isGameOver) {}
         }
 
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player lose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:66:40
         };
     }, [isGameOver, isGameStarted, time]);
 
-    const onClick = (coords: Coords)=> {
-        if (!isGameStarted) {
-            setIsGameStarted(true);
-        }
-
-        try{
-            const [newPlayerField, isSolved] = openCell(
-                coords, 
-                playerField, 
-                gameField,
-            );
-            if (isSolved) {
-                setGameOver(isSolved);
-            }
-            setPlayerField([...newPlayerField]);
-        } catch (e) {
-            console.log(e);
-            setPlayerField([... gameField]);
-            setGameOver();
-        }
-        
-    }
+    const onClick = (coords: Coords)=> {}
 
     const onContextMenu = (coords: Coords) => {
killedBy: GameWithHooks test cases Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 24
Received length: 0
Received array:  []

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:67:13
     }, [isGameOver, isGameStarted, time]);
 
     const onClick = (coords: Coords)=> {
-        if (!isGameStarted) {
+        if (isGameStarted) {
             setIsGameStarted(true);
         }
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player lose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:67:29
     }, [isGameOver, isGameStarted, time]);
 
     const onClick = (coords: Coords)=> {
-        if (!isGameStarted) {
-            setIsGameStarted(true);
-        }
+        if (!isGameStarted) {}
 
         try{
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player lose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:68:30
 
     const onClick = (coords: Coords)=> {
         if (!isGameStarted) {
-            setIsGameStarted(true);
+            setIsGameStarted(false);
         }
 
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player lose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:71:12
             setIsGameStarted(true);
         }
 
-        try{
-            const [newPlayerField, isSolved] = openCell(
-                coords, 
-                playerField, 
-                gameField,
-            );
-            if (isSolved) {
-                setGameOver(isSolved);
-            }
-            setPlayerField([...newPlayerField]);
-        } catch (e) {
+        try{} catch (e) {
             console.log(e);
             setPlayerField([... gameField]);
killedBy: GameWithHooks test cases Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 24
Received length: 0
Received array:  []

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:77:27
                 playerField, 
                 gameField,
             );
-            if (isSolved) {
-                setGameOver(isSolved);
-            }
+            if (isSolved) {}
             setPlayerField([...newPlayerField]);
         } catch (e) {
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player win the game when opening last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:81:21
                 setGameOver(isSolved);
             }
             setPlayerField([...newPlayerField]);
-        } catch (e) {
-            console.log(e);
-            setPlayerField([... gameField]);
-            setGameOver();
-        }
+        } catch (e) {}
         
     }
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player lose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:89:47
         
     }
 
-    const onContextMenu = (coords: Coords) => {
-        if (!isGameStarted) {
-            setIsGameStarted(true);
-        }
-        
-        const [newPlayerField, isSolved, newFlagCounter] = setFlag(
-            coords, 
-            playerField, 
-            gameField,
-            flagCounter,
-            bombs
-        );
-        setFlagCounter(newFlagCounter);
-
-        if (isSolved) {
-            setGameOver(isSolved);
-        }
-        setPlayerField([...newPlayerField]);
-    };
+    const onContextMenu = (coords: Coords) => {};
 
     const resetHandler = ([size, bombs]: [number, number]) => {
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 5
+ Received  + 1

@@ -72,26 +72,22 @@

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:90:13
     }
 
     const onContextMenu = (coords: Coords) => {
-        if (!isGameStarted) {
+        if (isGameStarted) {
             setIsGameStarted(true);
         }
killedBy: GameWithHooks test cases Open cell test cases Scoreboard behavior - timer and bomb counter Timer should start by flagging a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/modules/GameWithHooks/useGame.ts:90:13
     }
 
     const onContextMenu = (coords: Coords) => {
-        if (!isGameStarted) {
+        if (false) {
             setIsGameStarted(true);
         }
killedBy: GameWithHooks test cases Open cell test cases Scoreboard behavior - timer and bomb counter Timer should start by flagging a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:103:23
         );
         setFlagCounter(newFlagCounter);
 
-        if (isSolved) {
-            setGameOver(isSolved);
-        }
+        if (isSolved) {}
         setPlayerField([...newPlayerField]);
     };
killedBy: GameWithHooks test cases Open cell test cases Game over behavior Player win the game when flagging last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/modules/GameWithHooks/useGame.ts:103:13
         );
         setFlagCounter(newFlagCounter);
 
-        if (isSolved) {
+        if (true) {
             setGameOver(isSolved);
         }
killedBy: GameWithHooks test cases Open cell test cases Scoreboard behavior - timer and bomb counter Timer should start by flagging a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:109:63
         setPlayerField([...newPlayerField]);
     };
 
-    const resetHandler = ([size, bombs]: [number, number]) => {
-        const newGameField = fieldGenerator(size, bombs / (size * size))
-        const newPlayerField = generateFieldWithDefaultState(
-            size, 
-            CellState.hidden
-        );
-
-        setGameField([...newGameField])
-        setPlayerField([...newPlayerField]);
-        setIsGameOver(false);
-        setIsWin(false);
-        setIsGameStarted(false);
-        setTime(0);
-        setFlagCounter(0);
-    }
+    const resetHandler = ([size, bombs]: [number, number]) => {}
 
     const onChangeLevel = (level: LevelNames) => {
killedBy: GameWithHooks test cases Render behaiviour onChange game level handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 16
Received length: 9

[Killed] ArithmeticOperator
src/modules/GameWithHooks/useGame.ts:110:51
     };
 
     const resetHandler = ([size, bombs]: [number, number]) => {
-        const newGameField = fieldGenerator(size, bombs / (size * size))
+        const newGameField = fieldGenerator(size, bombs * (size * size))
         const newPlayerField = generateFieldWithDefaultState(
             size, 
killedBy: useGame test cases onReset game handler
statusReason: Error: Probability should be between 0 and 1

[Killed] ArithmeticOperator
src/modules/GameWithHooks/useGame.ts:110:60
     };
 
     const resetHandler = ([size, bombs]: [number, number]) => {
-        const newGameField = fieldGenerator(size, bombs / (size * size))
+        const newGameField = fieldGenerator(size, bombs / (size / size))
         const newPlayerField = generateFieldWithDefaultState(
             size, 
killedBy: useGame test cases onReset game handler
statusReason: Error: Probability should be between 0 and 1

[Killed] ArrayDeclaration
src/modules/GameWithHooks/useGame.ts:117:24
         );
 
         setGameField([...newGameField])
-        setPlayerField([...newPlayerField]);
+        setPlayerField([]);
         setIsGameOver(false);
         setIsWin(false);
killedBy: GameWithHooks test cases Render behaiviour onChange game level handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 16
Received length: 0
Received array:  []

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:118:23
 
         setGameField([...newGameField])
         setPlayerField([...newPlayerField]);
-        setIsGameOver(false);
+        setIsGameOver(true);
         setIsWin(false);
         setIsGameStarted(false);
killedBy: GameWithHooks test cases Open cell test cases onReset game handler
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:119:18
         setGameField([...newGameField])
         setPlayerField([...newPlayerField]);
         setIsGameOver(false);
-        setIsWin(false);
+        setIsWin(true);
         setIsGameStarted(false);
         setTime(0);
killedBy: GameWithHooks test cases Open cell test cases onReset game handler
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:120:26
         setPlayerField([...newPlayerField]);
         setIsGameOver(false);
         setIsWin(false);
-        setIsGameStarted(false);
+        setIsGameStarted(true);
         setTime(0);
         setFlagCounter(0);
killedBy: GameWithHooks test cases Open cell test cases onReset game handler
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:125:50
         setFlagCounter(0);
     }
 
-    const onChangeLevel = (level: LevelNames) => {
-        setLevel(level);
-        const newSettings = GameSettings[level];
-        resetHandler(newSettings);
-    };
+    const onChangeLevel = (level: LevelNames) => {};
 
     const onReset = () => resetHandler([size, bombs])
killedBy: GameWithHooks test cases Render behaiviour onChange game level handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 16
Received length: 9

[Killed] ArrowFunction
src/modules/GameWithHooks/useGame.ts:131:21
         resetHandler(newSettings);
     };
 
-    const onReset = () => resetHandler([size, bombs])
+    const onReset = () => undefined
 
     return {
killedBy: GameWithHooks test cases Open cell test cases onReset game handler
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
