[Killed] ArrowFunction
src/components/Game/GameArea.tsx:11:44
     children: ReactNode;
 }
 
-export const GameArea: FC<GameAreaProps> = ({ children }) => <Frame>{children}</Frame>;
+export const GameArea: FC<GameAreaProps> = () => undefined;
 
 const Frame = styled.div`
killedBy: Render game field by default
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0,0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="css-1ct4owg"
    >
