[Survived] ArrowFunction
src/components/Game/GameLayout.tsx:17:38
   children: ReactNode;
 }
 
-export const GameLayout: FC<Props> = ({ top, children }) => (
-  <Wrapper>
-    {top}
-    <GameArea>{children}</GameArea>
-  </Wrapper>
-);
+export const GameLayout: FC<Props> = () => undefined;
