[Killed] ArrowFunction
src/components/Game/Wrapper.tsx:12:42
 }
 
 
-export const Wrapper: FC<WrapperProps> = ({ children }) => <Frame>{children}</Frame>;
+export const Wrapper: FC<WrapperProps> = () => undefined;
 
 const Frame = styled.div`
killedBy: Render game field by default
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0,0"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
