[Killed] StringLiteral
src/components/Scoreboard/Counter.tsx:15:25
     <Frame>{children}</Frame>
 );
 
-const Frame = styled.div`
-    display: inline-block;
-    padding: 0 0.3vw;
-    color: #ec433c;
-    border: 0.15vw inset;
-    line-height: 2vw;
-    letter-spacing: 0.05em;
-    background: #333;
-    text-shadow: 0 0 0.1vw #ec433c;
-`;
+const Frame = styled.div``;
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 2
+ Received  + 2

@@ -38,11 +38,11 @@
