[Killed] ArrowFunction
src/components/Scoreboard/Scoreboard.tsx:37:48
     
 }
 
-export const Scoreboard: FC<ScoreboardProps> = ({
-    time, 
-    levels, 
-    bombs, 
-    defaultLevel, 
-    onReset, 
-    onChangeLevel: onChange
-}) => (
-    <Wrapper>
-        <Counter>{time}</Counter>
-        <Level onChange={onChange} value={defaultLevel}>
-            {levels}
-        </Level>
-        <Reset onReset={onReset}/>
-        <Counter>{bombs}</Counter>
-    </Wrapper>
-);
+export const Scoreboard: FC<ScoreboardProps> = () => undefined;
 
 const Wrapper = styled.div`
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 41
+ Received  +  0

@@ -35,51 +35,10 @@
