[Killed] ArrowFunction
src/components/Top/Top.tsx:10:42
 // interface TopProps {}
 export type TopComponentType = LegendProps & GameNameProps
 
-export const Top: FC<TopComponentType> = ({
-    children, 
-    ...LegendProps
-}) => (
-    <Header>
-        <GameName>{children}</GameName>
-        <Legend {...LegendProps} />
-    </Header>
-);
+export const Top: FC<TopComponentType> = () => undefined;
 
 const Header = styled.header`
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 31
+ Received  +  0

@@ -1,40 +1,9 @@
