[Killed] StringLiteral
src/modules/GameSettings.ts:1:38
-export const GameLevels: string[] = ['beginner', 'intermediate', 'expert'];
+export const GameLevels: string[] = ["", 'intermediate', 'expert'];
 
 export type LevelNames = typeof GameLevels[number];
killedBy: GameWithHooks test cases Render behaiviour Render game field by default
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "isGameOver": false,
    "isWin": false,

[Killed] ArrayDeclaration
src/modules/GameSettings.ts:1:37
-export const GameLevels: string[] = ['beginner', 'intermediate', 'expert'];
+export const GameLevels: string[] = [];
 
 export type LevelNames = typeof GameLevels[number];
killedBy: GameWithHooks test cases Render behaiviour Render game field by default
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "isGameOver": false,
    "isWin": false,
